src/cf/Enums/уатТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыВнешнихСистем</Name>
			<Comment>Типы внешних систем (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Comment>Система мониторинга.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессинговыйЦентр</Name>
					<Comment>Процессинговый центр.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаВзиманияПлаты</Name>
					<Comment>Система взимания платы.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисШтрафов</Name>
					<Comment>Сервис штрафов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисПарковок</Name>
					<Comment>Сервис парковок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисГеоданных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатТипыВнешнихСистем/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ИспользоватьСтрахование = ПолучитьФункциональнуюОпцию("уатИспользоватьСтрахование_уэ");
	
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СистемаМониторинга);
	ДанныеВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр);
	ДанныеВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты);
	ДанныеВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СервисШтрафов);
	ДанныеВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СервисПарковок);
	Если ИспользоватьСтрахование Тогда
		ДанныеВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СервисСтрахования);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
